#### Terraform Plan ✅ No changes
<details><summary>Show Plan</summary>

```terraform
data.aws_secretsmanager_secret.rds_password: Reading...
module.bastion.data.aws_ami.amazon_linux_2: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-02fbef0ac861c9274]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
data.aws_secretsmanager_secret.rds_password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:993450011441:secret:prod-rds-postgres-password-pwnGi2]
data.aws_secretsmanager_secret_version.rds_password_version: Reading...
data.aws_secretsmanager_secret_version.rds_password_version: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:993450011441:secret:prod-rds-postgres-password-pwnGi2|AWSCURRENT]
module.bastion.data.aws_ami.amazon_linux_2: Read complete after 1s [id=ami-069f9cce803c015bc]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-04da98f45b88f248e]
module.vpc.aws_security_group.lambda: Refreshing state... [id=sg-044f68a80e1af4713]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-012cbd94499798b95]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a6c7c920e23958c7]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-04daaea65dfdfb222]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-09fcbcb992263f92a]
module.vpc.aws_security_group.bastion: Refreshing state... [id=sg-0bd245916b0754ab4]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-080906d3c7200d7f9]
module.vpc.aws_security_group.rds: Refreshing state... [id=sg-0a2cda69f88b564bb]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c243b6dfb34680c2]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-039bbc6b069c8b7f5]
module.bastion.aws_instance.bastion: Refreshing state... [id=i-052bfef7a90128396]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0127c0e3b8cb3d594]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-02afbd11e95f64136]
module.vpc.aws_db_subnet_group.rds: Refreshing state... [id=tally-db-subnet-group]
module.rds.aws_db_instance.main: Refreshing state... [id=db-W4UXKW3AWJZXQNLKE67YBENXQI]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bastion.aws_instance.bastion must be replaced
-/+ resource "aws_instance" "bastion" {
      ~ ami                                  = "ami-0e6af742d565ff61c" -> "ami-069f9cce803c015bc" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-west-2:993450011441:instance/i-052bfef7a90128396" -> (known after apply)
      ~ availability_zone                    = "us-west-2a" -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-052bfef7a90128396" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0592e9bf87cffd36e" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-73.us-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.73" -> (known after apply)
      ~ public_dns                           = "ec2-44-248-60-203.us-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "44.248.60.203" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "prod"
            "Project"     = "tally"
            "Purpose"     = "bastion"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ primary_network_interface (known after apply)
      - primary_network_interface {
          - delete_on_termination = true -> null
          - network_interface_id  = "eni-0592e9bf87cffd36e" -> null
        }

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0c9e4e5f01b20e7e8" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.cloudfront.aws_cloudfront_distribution.frontend will be created
  + resource "aws_cloudfront_distribution" "frontend" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCenter"  = "solo-developer"
          + "Environment" = "prod"
          + "Project"     = "tally"
          + "Purpose"     = "frontend-static-site"
        }
      + tags_all                        = {
          + "CostCenter"  = "solo-developer"
          + "Environment" = "prod"
          + "Project"     = "tally"
          + "Purpose"     = "frontend-static-site"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "s3-frontend"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "tally-frontend-prod-993450011441.s3.amazonaws.com"
          + origin_access_control_id    = (known after apply)
          + origin_id                   = "s3-frontend"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.s3_oac will be created
  + resource "aws_cloudfront_origin_access_control" "s3_oac" {
      + arn                               = (known after apply)
      + description                       = "OAC for S3 static site"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "tally-frontend-prod-993450011441-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.frontend_s3.aws_s3_bucket.frontend will be created
  + resource "aws_s3_bucket" "frontend" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tally-frontend-prod-993450011441"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCenter"  = "solo-developer"
          + "Environment" = "prod"
          + "Project"     = "tally"
          + "Purpose"     = "frontend-static-site"
        }
      + tags_all                    = {
          + "CostCenter"  = "solo-developer"
          + "Environment" = "prod"
          + "Project"     = "tally"
          + "Purpose"     = "frontend-static-site"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.frontend_s3.aws_s3_bucket_acl.frontend_acl will be created
  + resource "aws_s3_bucket_acl" "frontend_acl" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-west-2"

      + access_control_policy (known after apply)
    }

  # module.frontend_s3.aws_s3_bucket_policy.frontend_cloudfront will be created
  + resource "aws_s3_bucket_policy" "frontend_cloudfront" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-west-2"
    }

  # module.frontend_s3.aws_s3_bucket_policy.frontend_public_read will be created
  + resource "aws_s3_bucket_policy" "frontend_public_read" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-west-2"
    }

  # module.frontend_s3.aws_s3_bucket_website_configuration.frontend will be created
  + resource "aws_s3_bucket_website_configuration" "frontend" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + region           = "us-west-2"
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "index.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

  # module.route53.aws_route53_record.frontend will be created
  + resource "aws_route53_record" "frontend" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "tally.kenhoward.dev"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.route53.aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "kenhoward.dev"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 10 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - bastion_id                   = "i-052bfef7a90128396" -> null
  - bastion_public_ip            = "44.248.60.203" -> null
  - bastion_security_group_id    = "sg-0bd245916b0754ab4" -> null
  - bastion_ssh_key_name         = "tally-bastion-key-prod" -> null
  - bastion_ssh_port             = 22 -> null
  - bastion_ssh_username         = "ec2-user" -> null
  + cloudfront_domain_name       = (known after apply)
  - db_subnet_group              = "tally-db-subnet-group" -> null
  + frontend_s3_website_endpoint = (known after apply)
  - rds_db_name                  = "tallydb" -> null
  - rds_endpoint                 = "terraform-20251028164240709000000001.ckfwhqwrg9tv.us-west-2.rds.amazonaws.com:5432" -> null
  - rds_instance_id              = "db-W4UXKW3AWJZXQNLKE67YBENXQI" -> null
  - rds_port                     = 5432 -> null
  - rds_username                 = "tallyadmin" -> null
  + route53_domain_name          = "kenhoward.dev"
  + route53_name_servers         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>